Subscribe to DataSciPie https://www.youtube.com/channel/UCClRgdNHjLdlYff86fPq5qw?sub_confirmation=1

# Data Wrangling

Data wrangling is the process of cleaning, structuring and enriching raw data for best prediction.

In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.read_csv(r'C:\Users\ASUS\Desktop\Dada\Datascipie\Lecture-7\Data_Wrangling.csv')

In [3]:
df

        a      b  c
0    94.5  171.2  A
1     NaN  176.6  B
2    99.4  176.6  C
3    99.8      X  D
4     NaN  192.7  E
5   105.8      X  F
6   105.8  192.7  G
7    99.5  178.2  H
8   101.2  176.8  I
9   101.2      X  J
10    NaN  176.8  K

In [7]:
edf=df.drop(['c'],axis=1)

In [8]:
edf

        a      b
0    94.5  171.2
1     NaN  176.6
2    99.4  176.6
3    99.8      X
4     NaN  192.7
5   105.8      X
6   105.8  192.7
7    99.5  178.2
8   101.2  176.8
9   101.2      X
10    NaN  176.8

In [12]:
fdf=edf.replace('X',np.nan)

In [13]:
fdf

        a      b
0    94.5  171.2
1     NaN  176.6
2    99.4  176.6
3    99.8    NaN
4     NaN  192.7
5   105.8    NaN
6   105.8  192.7
7    99.5  178.2
8   101.2  176.8
9   101.2    NaN
10    NaN  176.8

In [14]:
print(fdf.isna().sum())

a    3
b    3
dtype: int64

In [15]:
gdf=fdf.dropna(subset=['a','b'],axis=0)

In [16]:
gdf

       a      b
0   94.5  171.2
2   99.4  176.6
6  105.8  192.7
7   99.5  178.2
8  101.2  176.8

In [17]:
mean_a=fdf['a'].astype('float').mean(axis=0)

In [18]:
mean_a

100.9

In [19]:
hdf=fdf['a'].replace(np.nan,mean_a)

In [20]:
hdf

0      94.5
1     100.9
2      99.4
3      99.8
4     100.9
5     105.8
6     105.8
7      99.5
8     101.2
9     101.2
10    100.9
Name: a, dtype: float64

In [24]:
mean_b=fdf['b'].astype('float').mean(axis=0)

In [25]:
mean_b

180.2

In [26]:
idf=fdf['b'].replace(np.nan,mean_b)

In [27]:
idf

0     171.2
1     176.6
2     176.6
3     180.2
4     192.7
5     180.2
6     192.7
7     178.2
8     176.8
9     180.2
10    176.8
Name: b, dtype: object